---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.AngularDimensionRegenFailed
source: html/9446873f-7cee-c9fc-f758-614927016942.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.AngularDimensionRegenFailed Property

Can't form Angular Dimension.

## Syntax (C#)
```csharp
public static FailureDefinitionId AngularDimensionRegenFailed { get; }
```